# GUIs
## Privacy (Proton)
cask "protonvpn" # VPN
cask "proton-pass" # Password Manager
cask "proton-mail" # E-Mail and Calendar client
cask "proton-drive" # Cloud Storage

## Dev Tools
cask "raycast" # Spotlight Replacement
cask "ghostty" # Terminal Emulator
cask "bruno" # API OSS
cask "cursor" # AI Code Editor
cask "visual-studio-code" # Text Editor
vscode "github.github-vscode-theme"

## Other
cask "brave-browser" # browser
cask "google-chrome" # browser
cask "obsidian" # notes
cask "spotify" # music
cask "discord" # comms

# CLIs
## Dev Tools
brew "neovim" #  Vim fork
brew "gh" # GitHub CLI
brew "stow" # Symlink manager for dotfiles
brew "pyenv" # Python version management
brew "act" # run GitHub Actions locally
brew "azure-cli" # Microsoft Azure CLI 2.0
brew "zsh" # Z shell
brew "zsh-completions" # Additional completion definitions for zsh
brew "zsh-syntax-highlighting" # Fish shell-like syntax highlighting for zsh
brew "zsh-autosuggestions" # Fish-like autosuggestions for zsh
