# GUIs
cask "ghostty" # terminal emulator
cask "raycast" # app search
cask "rectangle" # resizable windows
cask "firefox" # browser
cask "google-chrome" # browser
cask "obsidian" # notes
cask "bruno" # API oss
cask "spotify" # music
cask "discord" # comms

cask "visual-studio-code" # text editor
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "redhat.vscode-xml"
vscode "usernamehw.errorlens"

# CUIs
brew "act" # run GitHub Actions locally
brew "azure-cli" # Microsoft Azure CLI 2.0
brew "dotnet" # .NET Core
brew "gh" # GitHub CLI
brew "neovim" #  Vim fork
brew "pyenv" # Python version management
brew "sst/tap/opencode" # terminal AI coding agent
