# GUIs
## Privacy (Proton)
cask "protonvpn" # VPN
cask "proton-pass" # Password Manager
cask "proton-mail" # E-Mail and Calendar client
cask "proton-drive" # Cloud Storage

## Dev Tools
cask "raycast" # Spotlight Replacement
cask "ghostty" # Terminal Emulator
cask "bruno" # API OSS
cask "cursor" # AI Code Editor
cask "visual-studio-code" # Text Editor
vscode "github.github-vscode-theme"

# nvim dependencies
brew "git"
brew "make"
brew "unzip"
brew "gcc"
brew "ripgrep"
brew "fd"
cask "font-jetbrains-mono-nerd-font"
brew "luarocks" # Lua package manager
brew "nvim" # Terminal Editor
brew "mise" # tool manager
brew "stow" # dotfiles symlinker
brew "tree" # dir tree explorer

## Other
cask "brave-browser" # browser
cask "google-chrome" # browser
cask "zen" # browser
cask "obsidian" # notes
cask "spotify" # music
cask "docker-desktop" # containerization
cask "discord" # comms
cask "anki" # flashcards
brew "gh" # github

# CLIs
## Dev Tools
brew "uv" # python package manager
brew "wget" # download files from the web